(https://www.bilibili.com/video/BV1Et4y1z7Dv)

#数据来源
  #用户数据：百度指数(index.baidu.com)
  #政府数据：国家统计局、国家政府网-数据
  #数据管理公司
  #自己爬去的数据
#数据分类
  #数据分析
  #人工智能训练
  #sell

#爬虫：自动爬取网页数据的程序
  #搜索引擎(超级爬虫)
  #惠惠购物助手：比较同款商品
  #抢票软件
#有用的数据
#robots.txt协议

#分类
  #通用网络爬虫：下载所有资源，Google、百度
  #聚焦网络爬虫：主题网络爬虫，有选择地爬取数据
  #增量式网络爬虫
  #深层网络爬虫

#原理

p8

# HTTP&HTTPS:
  #http:超文本传输协议，发布和接受html页面的方法，端口80
  #https：http协议的加密版本，端口443

p9
#url
#uri
#请求参数

p10
#get请求：浏览数据，不对服务器造成影响
#post请求：向服务器发送数据

p11
#user-agent：浏览器名称
#refer：前一个页面
#cookie：缓存

p12
p13

  


